import React, { useState } from 'react'
import "./Protocol.css"
import AddProtocol from '../../../ModalWindows/AddProtocol/AddProtocol';

const Protocol = () => {
    const [showModal, setShowModal] = useState(false);
    //Функция проверки, вызвано ли модальное окно
    const handleButtonClick = () => {
        setShowModal(true);
    };

    // Функция закрытия модального окна
    const handleModalClose = () => {
        setShowModal(false);
    };

    return (
        <div className='protocol'>
            <div className='header'>
                <p>Анализ данных</p>
                <div className='head-svg'>
                    <div>
                        <svg width="10" height="8" viewBox="0 0 15 4" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M1.37673 3.08001C1.07886 3.08001 0.824927 2.97395 0.614927 2.76182C0.404927 2.5497 0.299927 2.2947 0.299927 1.99682C0.299927 1.69895 0.405992 1.44501 0.618122 1.23501C0.830237 1.02501 1.08524 0.920013 1.38312 0.920013C1.68099 0.920013 1.93493 1.02608 2.14493 1.23821C2.35493 1.45032 2.45993 1.70532 2.45993 2.00321C2.45993 2.30108 2.35386 2.55501 2.14173 2.76501C1.92962 2.97501 1.67462 3.08001 1.37673 3.08001ZM7.49673 3.08001C7.19886 3.08001 6.94493 2.97395 6.73493 2.76182C6.52493 2.5497 6.41993 2.2947 6.41993 1.99682C6.41993 1.69895 6.52599 1.44501 6.73812 1.23501C6.95024 1.02501 7.20524 0.920013 7.50312 0.920013C7.80099 0.920013 8.05493 1.02608 8.26493 1.23821C8.47493 1.45032 8.57993 1.70532 8.57993 2.00321C8.57993 2.30108 8.47386 2.55501 8.26173 2.76501C8.04962 2.97501 7.79462 3.08001 7.49673 3.08001ZM13.6167 3.08001C13.3189 3.08001 13.0649 2.97395 12.8549 2.76182C12.6449 2.5497 12.5399 2.2947 12.5399 1.99682C12.5399 1.69895 12.646 1.44501 12.8581 1.23501C13.0702 1.02501 13.3252 0.920013 13.6231 0.920013C13.921 0.920013 14.1749 1.02608 14.3849 1.23821C14.5949 1.45032 14.6999 1.70532 14.6999 2.00321C14.6999 2.30108 14.5939 2.55501 14.3817 2.76501C14.1696 2.97501 13.9146 3.08001 13.6167 3.08001Z" fill="#2F9FD8" />
                        </svg>
                    </div>
                </div>
            </div>
            <div className='protocol-btns'>
                <button className='prot-dwnld' onClick={handleButtonClick}>Загрузить протоколы консультаций</button>
            </div>
            {showModal && <AddProtocol close={handleModalClose} />}
        </div>
    )
}

export default Protocol